#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
//int main() {

	//// 作业讲解
	//// 初始化，在定义变量的同时进行赋值的过程
	//// 在初始化时，一定要赋值为0，避免内存出现问题，
	//int a=0,b=0;
	//scanf("%d%d", &a, &b);
	//// 右移时，原始数据非负，补位补0；原始数据为负，补位补1；
	//int c=((a - b) >> 31)&1; //得到0或1, a大为0，b大为1
	//printf("%d", a - (a - b) * c); //

//	// 指针
//	int a=0;
//	// 指针 是用来存储地址信息的
//	// 定义指针变量时，*的个数代表指针的等级
//	// 一级指针 存储的是普通变量的地址
//	// 指针所占的空间大小和 变量类型没有关系
//	// 指针变量所占的空间大小，只取决于当前的编译环境
//	// x86（32位）4字节；x64（64位）8字节
//	int* p =&a; // 类型后面加*，代表一个指针变量，
//	int* b;
//	b = p; // 读取操作
//
//	int* pa = &a;  //int*pa; pa=&a;
//	int pb = &a;
//
//
//
//
//
//
//	printf("%d", sizeof(p)); 
//
//
//
//	return 0;
//
//}